insert into Categories
(name, code, description, parent_id, created_at, updated_at)
values
("Чашки", "cups", "Чашки з вашими яскравими зображеннями", 0, now(), now()),
("Чашки білі", "cups_white", "Білі чашки різних типів та форм", 1, now(), now()),
("Чашки кольорові", "cups_colorful", "Чашки з кольоровими вставками різних типів та форм", 1, now(), now()),
("Чашки Хамелеони", "cups_chameleons", "Незвичайні чашки, що змінюються під впливом температури рідини", 1, now(), now()),
("Чашки перламутрові", "cups_pearls", "Сяючі перламутрові та дзверкальні чашки", 1, now(), now()),
("Чашки скляні", "cups_glass", "Скляні чашки", 1, now(), now());

insert into Colors
(name, code)
values
('білий', 'white'),
('бордовий', 'burgundy'),
('червоний', 'red'),
('оранжевий', 'orange'),
('жовтий', 'yellow'),
('салатовий', 'lettuce'),
('зелений', 'green'),
('блакитний', 'azure'),
('синій', 'blue'),
('рожевий', 'pink'),
('чорний', 'black');


insert into Products
(name, code, description, category_id, color_id, price, count_left, created_at, updated_at)
values
('Чашка циліндрична', 'cylinder', 'Чашка біла циліндрична. Покриття глянцеве. Об\'єм 330 мл, висота 9.5 см, діаметр 8 см. Зображення стійке до механічних ударів, миття в гарячій воді та посудомийній машині з використанням різних миючих засобів. Зображення не стирається, не блідніє та не портиться з часом. Чашка екологічна та абсолютно безпечна для здоров\'я.', 2, 1, 5000, 10, now(), now()),
('Чашка циліндрична велика', 'cylinder_big', 'Чашка біла циліндрична велика. Покриття глянцеве. Об\'єм 425 мл, висота 10.5 см, діаметр 8.4 см. Зображення стійке до механічних ударів, миття в гарячій воді та посудомийній машині з використанням різних миючих засобів. Зображення не стирається, не блідніє та не портиться з часом. Чашка екологічна та абсолютно безпечна для здоров\'я.', 2, 1, 7000, 10, now(), now()),
('Чашка конусовидна Latte', 'latte', 'Чашка біла конусовидна \"Латте\". Покриття глянцеве. Об\'єм 350 мл, висота 10 см, діаметр дна 6 см, діаметр горловини 9 см. Зображення стійке до механічних ударів, миття в гарячій воді та посудомийній машині з використанням різних миючих засобів. Зображення не стирається, не блідніє та не портиться з часом. Чашка екологічна та абсолютно безпечна для здоров\'я.', 2, 1, 7000, 10, now(), now()),
('Чашка конусовидна Latte велика', 'latte_big', 'Чашка біла конусовидна \"Латте\" велика. Покриття глянцеве. Об\'єм 480 мл, висота 15 см, діаметр дна 6 см, діаметр горловини 9 см. Зображення стійке до механічних ударів, миття в гарячій воді та посудомийній машині з використанням різних миючих засобів. Зображення не стирається, не блідніє та не портиться з часом. Чашка екологічна та абсолютно безпечна для здоров\'я.', 2, 1, 9000, 10, now(), now());
/*('', '', '', , , , now(), now()),
('', '', '', , , , now(), now()),*/

/*alter table Categories add constraint unique(code);
alter table products add constraint unique(code);*/


insert into users
(email, password, name, created_at, updated_at)
values
('antonyuksofi@ukr.net', '111', 'Софія', now(), now());